In [1]:
%load_ext sql
import sqlite3
import pandas as pd

In [2]:
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

# 4. CourseData Database Integrity Checks

## A. How many seats remain for Professor Bloch's Spring 2018 classes?

In [3]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, INSTRUCTOR_NAME, COURSE_OFFERINGS.TERM
FROM COURSE_OFFERINGS
    JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID)
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)
WHERE INSTRUCTOR_NAME LIKE '%Bloch' AND COURSE_OFFERINGS.TERM = 'Spring2018'
ORDER BY REMAINING DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(34137, 1, 24, 2, 'Rebecca I.  Bloch', 'Spring2018'),
 (34085, 1, 25, -2, 'Rebecca I.  Bloch', 'Spring2018'),
 (34164, 2, 25, -4, 'Rebecca I.  Bloch', 'Spring2018')]

## B. What is the actual enrollment for a class compared to capacity for courses in Fall 2018?

In [4]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, ACTUAL, COURSE_MEETINGS.TERM
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (CRN)
WHERE COURSE_MEETINGS.TERM = 'Fall2018'
ORDER BY ACTUAL DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(74173, 1, 64, 65, 'Fall2018'),
 (74362, 1, 60, 62, 'Fall2018'),
 (74754, '01C', 0, 60, 'Fall2018'),
 (75868, 'A-C', 0, 58, 'Fall2018'),
 (75823, 2, 64, 58, 'Fall2018'),
 (75304, 4, 60, 57, 'Fall2018'),
 (74598, 1, 60, 57, 'Fall2018'),
 (74839, '02C', 0, 56, 'Fall2018'),
 (75964, '03C', 0, 56, 'Fall2018'),
 (75814, 4, 60, 56, 'Fall2018')]

## C. Which classrooms are the most utilized?

In [5]:
%%sql
-- Shows the number of classes that have been taught in each classroom
SELECT DISTINCT COURSE_MEETINGS.LOCATION_ID, ROOM_ID, COUNT(COURSE_OFFERING_ID)
FROM COURSE_MEETINGS
    LEFT JOIN LOCATIONS USING (LOCATION_ID)
WHERE ROOM_ID LIKE "%DSB%"
GROUP BY COURSE_MEETINGS.LOCATION_ID, ROOM_ID
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[(98, 'DSB 104', 3577),
 (99, 'DSB 105', 3392),
 (100, 'DSB 106', 3609),
 (101, 'DSB 107', 2712),
 (102, 'DSB 108', 3936),
 (103, 'DSB 109', 3810),
 (104, 'DSB 110', 4),
 (105, 'DSB 110A', 2699),
 (106, 'DSB 110B', 2855),
 (107, 'DSB 111', 3501),
 (108, 'DSB 112', 3877),
 (109, 'DSB 114', 2712),
 (110, 'DSB 115', 3391),
 (111, 'DSB 2109A', 1439)]

## D. How many classes has each professor taught?

In [22]:
%%sql
-- Should be 26, it is doubling for some reason
SELECT DISTINCT INSTRUCTOR_ID, INSTRUCTOR_NAME,COUNT(DISTINCT CRN)
FROM COURSE_OFFERINGS
    JOIN COURSES USING (CATALOG_ID)
    JOIN INSTRUCTORS ON COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID
GROUP BY INSTRUCTOR_ID
ORDER BY 
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne', 28),
 (2, 'Rebecca I.  Bloch', 26),
 (3, 'Paul   Caster', 28),
 (4, 'Jo Ann   Drusbosky', 35),
 (5, 'Arleen N.  Kardos', 20),
 (6, 'Scott M  Brenner', 27),
 (7, 'Kevin C.  Cassidy', 4),
 (8, 'Bruce   Bradford', 31),
 (9, 'Milo W.  Peck', 47),
 (10, 'Stephen E.  Yost', 21)]

## E. How many courses are in each program?

In [7]:
%%sql
SELECT DISTINCT PROGRAMS.PROGRAM_ID, PROGRAM_NAME,COUNT(CATALOG_ID)
FROM COURSES
    JOIN PROGRAMS USING (PROGRAM_ID)
GROUP BY PROGRAMS.PROGRAM_ID, PROGRAM_NAME
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Accounting', 68),
 (2, 'Applied Ethics', 64),
 (3, 'Art History', 72),
 (4, 'Asian Studies', 4),
 (5, 'Arabic', 16),
 (6, 'American Studies', 90),
 (7, 'Anthropology', 40),
 (8, 'Business', 20),
 (9, 'Bioengineering', 14),
 (10, 'Biology', 190)]